1667. Fix Names in a Table

Table: Users

+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| name           | varchar |
+----------------+---------+
user_id is the primary key (column with unique values) for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.
 

Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

The result format is in the following example.

 

Example 1:

Input: 
Users table:
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | aLice |
| 2       | bOB   |
+---------+-------+
Output: 
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | Alice |
| 2       | Bob   |
+---------+-------+

In [12]:
import pandas as pd

data = {"user_id":[1,2,3],"name":["aLice","bOB","MaRRy aNN"]}

Users= pd.DataFrame(data)

In [13]:
Users

   user_id       name
0        1      aLice
1        2        bOB
2        3  MaRRy aNN

In [14]:
Users["name"] = Users["name"].str.title() # title() can be used on str object, so convert each value to string object first and then use title function

Users

   user_id       name
0        1      Alice
1        2        Bob
2        3  Marry Ann

In [15]:
Users.sort_values("user_id", inplace=True)
Users

   user_id       name
0        1      Alice
1        2        Bob
2        3  Marry Ann

This approach also creates a problem as this will make first letter of second name caps which is incorrect as per leetcode requirement

In [17]:
Users= pd.DataFrame(data)
Users

   user_id       name
0        1      aLice
1        2        bOB
2        3  MaRRy aNN

In [21]:
Users["name"]=  Users["name"].str.lower() 
Users["name"] = Users["name"].str.capitalize()

Users

   user_id       name
0        1      Alice
1        2        Bob
2        3  Marry ann